-- MySQL dump 10.16  Distrib 10.1.20-MariaDB, for osx10.12 (x86_64)
--
-- Host: unit    Database: unit
-- ------------------------------------------------------
-- Server version	10.3.9-MariaDB-1:10.3.9+maria~bionic

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `t_postcode`
--

DROP TABLE IF EXISTS `t_postcode`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `t_postcode` (
  `id` int(11) NOT NULL,
  `JLG_Code` int(11) DEFAULT NULL,
  `old_postcade` int(11) DEFAULT NULL,
  `postcode` int(11) DEFAULT NULL,
  `prefectural_kana` varchar(64) DEFAULT NULL,
  `municipality_kana` varchar(64) DEFAULT NULL,
  `town_kana` varchar(64) DEFAULT NULL,
  `prefectural` varchar(64) DEFAULT NULL,
  `municipality` varchar(64) DEFAULT NULL,
  `town` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_postcode`
--

LOCK TABLES `t_postcode` WRITE;
/*!40000 ALTER TABLE `t_postcode` DISABLE KEYS */;
INSERT INTO `t_postcode` VALUES (1,1101,60,600022,'ホッカイドウ','サッポロシチュウオウク','キタ22ジョウニシ','北海道','札幌市中央区','北二十二条西'),(2,1202,40,400022,'ホッカイドウ','ハコダテシ','ヒノデチョウ','北海道','函館市','日乃出町'),(3,1204,70,700022,'ホッカイドウ','アサヒカワシ','ヒガシ2ジョウ','北海道','旭川市','東２条'),(4,1207,80,800022,'ホッカイドウ','オビヒロシ','ニシ12ジョウミナミ','北海道','帯広市','西十二条南'),(5,1208,90,900022,'ホッカイドウ','キタミシ','キタ2ジョウヒガシ','北海道','北見市','北二条東'),(6,3201,20,200022,'イワテケン','モリオカシ','オオドオリ','岩手県','盛岡市','大通'),(7,4101,980,9800022,'ミヤギケン','センダイシアオバク','イツツバシ','宮城県','仙台市青葉区','五橋'),(8,5201,10,100022,'アキタケン','アキタシ','ナラヤマミナミナカチョウ','秋田県','秋田市','楢山南中町'),(9,6201,990,9900022,'ヤマガタケン','ヤマガタシ','ヒガシヤマガタ','山形県','山形市','東山形'),(10,8201,310,3100022,'イバラキケン','ミトシ','バイコウ','茨城県','水戸市','梅香'),(11,8203,300,3000022,'イバラキケン','ツチウラシ','シラトリマチ','茨城県','土浦市','白鳥町'),(12,9201,320,3200022,'トチギケン','ウツノミヤシ','センナミマチ','栃木県','宇都宮市','千波町'),(13,10202,370,3700022,'グンマケン','タカサキシ','シュクヨコテマチ','群馬県','高崎市','宿横手町'),(14,11201,350,3500022,'サイタマケン','カワゴエシ','コナカイ','埼玉県','川越市','小中居'),(15,11202,360,3600022,'サイタマケン','クマガヤシ','トデ','埼玉県','熊谷市','戸出'),(16,11221,340,3400022,'サイタマケン','ソウカシ','セザキ','埼玉県','草加市','瀬崎'),(17,12101,260,2600022,'チバケン','チバシチュウオウク','シンメイチョウ','千葉県','千葉市中央区','神明町'),(18,12207,270,2700022,'チバケン','マツドシ','クリガサワ','千葉県','松戸市','栗ケ沢'),(19,12219,290,2900022,'チバケン','イチハラシ','サイヒロ','千葉県','市原市','西広'),(20,13104,160,1600022,'トウキョウト','シンジュクク','シンジュク','東京都','新宿区','新宿'),(21,13107,130,1300022,'トウキョウト','スミダク','コウトウバシ','東京都','墨田区','江東橋'),(22,13113,150,1500022,'トウキョウト','シブヤク','エビスミナミ','東京都','渋谷区','恵比寿南'),(23,13121,120,1200022,'トウキョウト','アダチク','ヤナギハラ','東京都','足立区','柳原'),(24,13202,190,1900022,'トウキョウト','タチカワシ','ニシキチョウ','東京都','立川市','錦町'),(25,13203,180,1800022,'トウキョウト','ムサシノシ','サカイ','東京都','武蔵野市','境'),(26,14101,230,2300022,'カナガワケン','ヨコハマシツルミク','イチバヒガシナカチョウ','神奈川県','横浜市鶴見区','市場東中町'),(27,14103,220,2200022,'カナガワケン','ヨコハマシニシク','ハナサキチョウ','神奈川県','横浜市西区','花咲町'),(28,14106,240,2400022,'カナガワケン','ヨコハマシホドガヤク','ニシクボチョウ','神奈川県','横浜市保土ケ谷区','西久保町'),(29,14131,210,2100022,'カナガワケン','カワサキシカワサキク','イケダ','神奈川県','川崎市川崎区','池田'),(30,14206,250,2500022,'カナガワケン','オダワラシ','イシバシ','神奈川県','小田原市','石橋'),(31,15102,950,9500022,'ニイガタケン','ニイガタシヒガシク','コウエイ','新潟県','新潟市東区','幸栄'),(32,15202,940,9400022,'ニイガタケン','ナガオカシ','ヒガシアラマチ','新潟県','長岡市','東新町'),(33,16201,930,9300022,'トヤマケン','トヤマシ','コジマチョウ','富山県','富山市','小島町'),(34,17201,920,9200022,'イシカワケン','カナザワシ','キタヤスエ','石川県','金沢市','北安江'),(35,18201,910,9100022,'フクイケン','フクイシ','カゲツ','福井県','福井市','花月'),(36,19201,400,4000022,'ヤマナシケン','コウフシ','モトコンヤマチ','山梨県','甲府市','元紺屋町'),(37,19208,40002,4000226,'ヤマナシケン','ミナミアルプスシ','アリノ','山梨県','南アルプス市','有野'),(38,19208,40002,4000222,'ヤマナシケン','ミナミアルプスシ','イイノ','山梨県','南アルプス市','飯野'),(39,19208,40002,4000224,'ヤマナシケン','ミナミアルプスシ','イイノシンデン','山梨県','南アルプス市','飯野新田'),(40,19208,40002,4000223,'ヤマナシケン','ミナミアルプスシ','クルワダシンデン','山梨県','南アルプス市','曲輪田新田'),(41,19208,40002,4000221,'ヤマナシケン','ミナミアルプスシ','ザイケツカ','山梨県','南アルプス市','在家塚'),(42,19208,40002,4000225,'ヤマナシケン','ミナミアルプスシ','ツクヤマ','山梨県','南アルプス市','築山'),(43,22101,420,4200022,'シズオカケン','シズオカシアオイク','クルマチョウ','静岡県','静岡市葵区','車町'),(44,22203,410,4100022,'シズオカケン','ヌマヅシ','オオオカ','静岡県','沼津市','大岡'),(45,23106,460,4600022,'アイチケン','ナゴヤシナカク','カナヤマ','愛知県','名古屋市中区','金山'),(46,23201,440,4400022,'アイチケン','トヨハシシ','イワサキチョウ','愛知県','豊橋市','岩崎町'),(47,24202,510,5100022,'ミエケン','ヨッカイチシ','ダイキョウチョウ','三重県','四日市市','大協町'),(48,25201,520,5200022,'シガケン','オオツシ','ヤナガサキ','滋賀県','大津市','柳が崎'),(49,26201,620,6200022,'キョウトフ','フクチヤマシ','シモヤナギ','京都府','福知山市','下柳'),(50,27106,550,5500022,'オオサカフ','オオサカシニシク','ホンデン','大阪府','大阪市西区','本田'),(51,27127,530,5300022,'オオサカフ','オオサカシキタク','ナニワチョウ','大阪府','大阪市北区','浪花町'),(52,27128,540,5400022,'オオサカフ','オオサカシチュウオウク','イトヤマチ','大阪府','大阪市中央区','糸屋町'),(53,27141,590,5900022,'オオサカフ','サカイシサカイク','ナカミクニガオカチョウ','大阪府','堺市堺区','中三国ケ丘町'),(54,27203,560,5600022,'オオサカフ','トヨナカシ','キタサクラヅカ','大阪府','豊中市','北桜塚'),(55,27209,570,5700022,'オオサカフ','モリグチシ','アカツキチョウ','大阪府','守口市','暁町'),(56,27217,580,5800022,'オオサカフ','マツバラシ','カワイ','大阪府','松原市','河合'),(57,28110,650,6500022,'ヒョウゴケン','コウベシチュウオウク','モトマチドオリ','兵庫県','神戸市中央区','元町通'),(58,28201,670,6700022,'ヒョウゴケン','ヒメジシ','コリキマチ','兵庫県','姫路市','小利木町'),(59,31201,680,6800022,'トットリケン','トットリシ','ニシマチ','鳥取県','鳥取市','西町'),(60,32201,690,6900022,'シマネケン','マツエシ','アオバダイ','島根県','松江市','青葉台'),(61,33101,700,7000022,'オカヤマケン','オカヤマシキタク','イワタチョウ','岡山県','岡山市北区','岩田町'),(62,33202,710,7100022,'オカヤマケン','クラシキシ','ハヤタカ','岡山県','倉敷市','早高'),(63,34101,730,7300022,'ヒロシマケン','ヒロシマシナカク','カナヤマチョウ','広島県','広島市中区','銀山町'),(64,34207,720,7200022,'ヒロシマケン','フクヤマシ','ナラヅチョウ','広島県','福山市','奈良津町'),(65,35201,750,7500022,'ヤマグチケン','シモノセキシ','カンセイホンマチ','山口県','下関市','関西本町'),(66,35208,740,7400022,'ヤマグチケン','イワクニシ','ヤマテマチ','山口県','岩国市','山手町'),(67,36201,770,7700022,'トクシマケン','トクシマシ','サコ2バンチョウ','徳島県','徳島市','佐古二番町'),(68,37201,760,7600022,'カガワケン','タカマツシ','ニシウチマチ','香川県','高松市','西内町'),(69,38201,790,7900022,'エヒメケン','マツヤマシ','エイダイマチ','愛媛県','松山市','永代町'),(70,39201,780,7800022,'コウチケン','コウチシ','キタジンゼンジ','高知県','高知市','北秦泉寺'),(71,40101,800,8000022,'フクオカケン','キタキュウシュウシモジク','ダイリヒガシ','福岡県','北九州市門司区','大里東'),(72,40107,80002,8000223,'フクオカケン','キタキュウシュウシコクラミナミク','カミソネ','福岡県','北九州市小倉南区','上曽根'),(73,40107,80002,8000221,'フクオカケン','キタキュウシュウシコクラミナミク','シモソネシンマチ','福岡県','北九州市小倉南区','下曽根新町'),(74,40107,80002,8000229,'フクオカケン','キタキュウシュウシコクラミナミク','ソネキタマチ','福岡県','北九州市小倉南区','曽根北町'),(75,40107,80002,8000220,'フクオカケン','キタキュウシュウシコクラミナミク','ソネシンデンミナミ','福岡県','北九州市小倉南区','曽根新田南'),(76,40107,80002,8000225,'フクオカケン','キタキュウシュウシコクラミナミク','タハラ','福岡県','北九州市小倉南区','田原'),(77,40107,80002,8000226,'フクオカケン','キタキュウシュウシコクラミナミク','タハラシンマチ','福岡県','北九州市小倉南区','田原新町'),(78,40107,80002,8000227,'フクオカケン','キタキュウシュウシコクラミナミク','ツダシンマチ','福岡県','北九州市小倉南区','津田新町'),(79,40107,80002,8000222,'フクオカケン','キタキュウシュウシコクラミナミク','ナカソネ','福岡県','北九州市小倉南区','中曽根'),(80,40107,80002,8000228,'フクオカケン','キタキュウシュウシコクラミナミク','ナガノ','福岡県','北九州市小倉南区','長野'),(81,40107,80002,8000224,'フクオカケン','キタキュウシュウシコクラミナミク','ヒガシヌキ','福岡県','北九州市小倉南区','東貫'),(82,40133,810,8100022,'フクオカケン','フクオカシチュウオウク','ヤクイン','福岡県','福岡市中央区','薬院'),(83,40203,830,8300022,'フクオカケン','クルメシ','ジョウナンマチ','福岡県','久留米市','城南町'),(84,40205,820,8200022,'フクオカケン','イイヅカシ','ミョウジョウジ','福岡県','飯塚市','明星寺'),(85,41201,840,8400022,'サガケン','サガシ','ナカノタテマチ','佐賀県','佐賀市','中の館町'),(86,42201,850,8500022,'ナガサキケン','ナガサキシ','ウママチ','長崎県','長崎市','馬町'),(87,43101,860,8600022,'クマモトケン','クマモトシチュウオウク','ヨココウヤマチ','熊本県','熊本市中央区','横紺屋町'),(88,44201,870,8700022,'オオイタケン','オオイタシ','オオテマチ','大分県','大分市','大手町'),(89,45201,880,8800022,'ミヤザキケン','ミヤザキシ','オオハシ','宮崎県','宮崎市','大橋'),(90,46201,890,8900022,'カゴシマケン','カゴシマシ','オノチョウ','鹿児島県','鹿児島市','小野町'),(91,47201,900,9000022,'オキナワケン','ナハシ','ヒガワ','沖縄県','那覇市','樋川');
/*!40000 ALTER TABLE `t_postcode` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-08-29  0:47:51
